Revit 2024 API
PerformanceAdviser.GetElementFilterFromRule Method (PerformanceAdviserRuleId, Document)
 Retrieves a filter to restrict elements to be checked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ElementFilter GetElementFilterFromRule(
	PerformanceAdviserRuleId id,
	Document document
)
Visual Basic
Public Function GetElementFilterFromRule ( _
	id As PerformanceAdviserRuleId, _
	document As Document _
) As ElementFilter
Visual C++
public:
ElementFilter^ GetElementFilterFromRule(
	PerformanceAdviserRuleId^ id,
	Document^ document
)
Parameters
id
Type: Autodesk.Revit.DB.PerformanceAdviserRuleId
 The rule id to get information for.
document
Type: Autodesk.Revit.DB.Document
 Document for which performance problems are being checked.
Return Value
 The filter to restrict elements to be checked.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PerformanceAdviser Class
GetElementFilterFromRule Overload
Autodesk.Revit.DB Namespace